Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipfs</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository_file.this["go-protocolnetwork/.github/workflows/stale.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "chore: Update .github/workflows/stale.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Close and mark stale issue
            
            on:
              schedule:
              - cron: '0 0 * * *'
            
            jobs:
              stale:
            
                runs-on: ubuntu-latest
                permissions:
                  issues: write
                  pull-requests: write
            
                steps:
                - uses: actions/stale@v3
                  with:
                    repo-token: ${{ secrets.GITHUB_TOKEN }}
                    stale-issue-message: 'Oops, seems like we needed more information for this issue, please comment with more details or this issue will be closed in 7 days.'
                    close-issue-message: 'This issue was closed because it is missing author input.'
                    stale-issue-label: 'kind/stale'
                    any-of-labels: 'need/author-input'
                    exempt-issue-labels: 'need/triage,need/community-input,need/maintainer-input,need/maintainers-input,need/analysis,status/blocked,status/in-progress,status/ready,status/deferred,status/inactive'
                    days-before-issue-stale: 6
                    days-before-issue-close: 7
                    enable-statistics: true
        EOT
      + file                = ".github/workflows/stale.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "go-protocolnetwork"
      + sha                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->